{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv1", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "conv1_relu_padded", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 1, 0, 1)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch1", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2a_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2a_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2a_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2a_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2a", 
      "inputs": [[17, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2b_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2b_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2b_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2b_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2b", 
      "inputs": [[42, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res2c_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res2c_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2c_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2c_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 1], [89, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res2c", 
      "inputs": [[67, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res2c_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch1", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 1], [98, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[92, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 1], [105, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3a_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3a_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3a_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3a_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3a", 
      "inputs": [[99, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0], [137, 0, 1], [138, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b1_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b1_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b1_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b1_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3b1", 
      "inputs": [[124, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 1], [155, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 1], [163, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b2_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b2_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b2_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b2_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3b2", 
      "inputs": [[149, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b3_branch2a_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b3_branch2a", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2a_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b3_branch2a", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0], [179, 0, 1], [180, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b3_branch2a_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b3_branch2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b3_branch2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2b_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2b_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2b_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2b_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b3_branch2b", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0], [187, 0, 1], [188, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b3_branch2b_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res3b3_branch2c_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res3b3_branch2c", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2c_gamma", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2c_beta", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2c_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3b3_branch2c_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3b3_branch2c", 
      "attr": {
        "cudnn_off": "True", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0], [194, 0, 0], [195, 0, 1], [196, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "res3b3", 
      "inputs": [[174, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "res3b3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res4a_branch1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
